Revit 2024 API
BuiltInFailures.SiteFailures.SiteMergeDisconnected Property
 The two surfaces you are trying to merge are disconnected from one another. They should overlap, or at least share edges.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SiteMergeDisconnected { get; }
Visual Basic
Public Shared ReadOnly Property SiteMergeDisconnected As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SiteMergeDisconnected {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace